[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:64:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {hasRole(currentUser, "ROLE_PROFESSOR") && (
-                <NavDropdown
-                  title="Professor"
-                  id="appnavbar-professor-dropdown"
-                  data-testid="appnavbar-professor-dropdown"
-                >
-                  <NavDropdown.Item href="/requests/pending">
-                    Pending Requests
-                  </NavDropdown.Item>
-                  <NavDropdown.Item href="/requests/completed">
-                    Completed Requests
-                  </NavDropdown.Item>
-                  <NavDropdown.Item href="/requests/statistics">
-                    Statistics
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_PROFESSOR") || <NavDropdown title="Professor" id="appnavbar-professor-dropdown" data-testid="appnavbar-professor-dropdown">
+                  <NavDropdown.Item href="/requests/pending">
+                    Pending Requests
+                  </NavDropdown.Item>
+                  <NavDropdown.Item href="/requests/completed">
+                    Completed Requests
+                  </NavDropdown.Item>
+                  <NavDropdown.Item href="/requests/statistics">
+                    Statistics
+                  </NavDropdown.Item>
+                </NavDropdown>}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for professor user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-professor-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:64:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {hasRole(currentUser, "ROLE_PROFESSOR") && (
-                <NavDropdown
-                  title="Professor"
-                  id="appnavbar-professor-dropdown"
-                  data-testid="appnavbar-professor-dropdown"
-                >
-                  <NavDropdown.Item href="/requests/pending">
-                    Pending Requests
-                  </NavDropdown.Item>
-                  <NavDropdown.Item href="/requests/completed">
-                    Completed Requests
-                  </NavDropdown.Item>
-                  <NavDropdown.Item href="/requests/statistics">
-                    Statistics
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for professor user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-professor-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
