[Killed] MethodExpression
main/components/RequestTypeDropdown/RequestTypeDropdown.js:31:3
   };
   // Stryker restore all
 
-  requests.sort(compareValues("requestCode"));
+  requests;
 
   return (
killedBy: SingleRequestDropdown Component renders requests in sorted order by requestCode
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MS program (other than CS Dept BS/MS)",
    "PhD program",

[Killed] BlockStatement
main/components/RequestTypeDropdown/RequestTypeDropdown.js:41:41
         value={requestState}
         onChange={handleRequestOnChange}
       >
-        {requests.map(function (object) {
-          const key = `${controlId}-option-${object.id}`;
-          return (
-            <option key={key} data-testid={key} value={object.requestType}>
-              {object.requestType}
-            </option>
-          );
-        })}
+        {requests.map(function (object) {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleRequestDropdown Component renders all options correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Scholarship or Fellowship. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
