[Killed] BlockStatement
src/main/utils/sortHelper.js:27:35
 
 // Stryker disable next-line StringLiteral: The "" mutant results in equivalent mutant due to it defaulting to ascending sort if order is not "desc"
 export function compareValues(key, order = "asc") {
-  return function innerSort(a, b) {
-    // Logical Operator: Requiring only one object to have the property causes comparisons to undefined to be equivalent (> or < to undefined evaluates to false which will return 0)
-    // Conditional Expression: Changing to false could have both properties be undefined but < > comparisons to undefeind are equivalent to false, returning 0 anyway
-    // BlockStatement: Removing "Return 0" reults in equivalent mutant since one or both elements will be undefined and < > comparisons will evaluate to false
-    // Stryker disable next-line LogicalOperator, ConditionalExpression, BlockStatement: Each mutant results in equivalent code (reasons in above code comment)
-    if (!a.hasOwnProperty(key) || !b.hasOwnProperty(key)) {
-      // property doesn't exist on either object
-      return 0;
-    }
-
-    const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
-    const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
-
-    let comparison = 0;
-    // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
-    if (varA > varB) {
-      comparison = 1;
-    } else if (varA < varB) {
-      comparison = -1;
-    }
-    return (
-      // Stryker disable next-line ArithmeticOperator: The / mutant results in an equivalent mutant
-      order === "desc" ? comparison * -1 : comparison
-    );
-  };
+  return function innerSort(a, b) {};
 }
 
killedBy: SingleRequestDropdown Component renders requests in sorted order by requestCode
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MS program (other than CS Dept BS/MS)",
    "PhD program",

[Killed] BooleanLiteral
src/main/utils/sortHelper.js:32:9
     // Conditional Expression: Changing to false could have both properties be undefined but < > comparisons to undefeind are equivalent to false, returning 0 anyway
     // BlockStatement: Removing "Return 0" reults in equivalent mutant since one or both elements will be undefined and < > comparisons will evaluate to false
     // Stryker disable next-line LogicalOperator, ConditionalExpression, BlockStatement: Each mutant results in equivalent code (reasons in above code comment)
-    if (!a.hasOwnProperty(key) || !b.hasOwnProperty(key)) {
+    if (a.hasOwnProperty(key) || !b.hasOwnProperty(key)) {
       // property doesn't exist on either object
       return 0;
killedBy: SingleRequestDropdown Component renders requests in sorted order by requestCode
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MS program (other than CS Dept BS/MS)",
    "PhD program",

[Killed] BooleanLiteral
src/main/utils/sortHelper.js:32:35
     // Conditional Expression: Changing to false could have both properties be undefined but < > comparisons to undefeind are equivalent to false, returning 0 anyway
     // BlockStatement: Removing "Return 0" reults in equivalent mutant since one or both elements will be undefined and < > comparisons will evaluate to false
     // Stryker disable next-line LogicalOperator, ConditionalExpression, BlockStatement: Each mutant results in equivalent code (reasons in above code comment)
-    if (!a.hasOwnProperty(key) || !b.hasOwnProperty(key)) {
+    if (!a.hasOwnProperty(key) || b.hasOwnProperty(key)) {
       // property doesn't exist on either object
       return 0;
killedBy: SingleRequestDropdown Component renders requests in sorted order by requestCode
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MS program (other than CS Dept BS/MS)",
    "PhD program",

[Killed] ConditionalExpression
src/main/utils/sortHelper.js:37:18
       return 0;
     }
 
-    const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
+    const varA = false ? a[key].toUpperCase() : a[key];
     const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
 
killedBy: sortHelper tests should sort properly with capitals
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -2,12 +2,12 @@
    Object {
      "id": 1,

[Killed] ConditionalExpression
src/main/utils/sortHelper.js:37:18
       return 0;
     }
 
-    const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
+    const varA = true ? a[key].toUpperCase() : a[key];
     const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
 
killedBy: sortHelper tests should sort by year born
statusReason: TypeError: a[key].toUpperCase is not a function

[Killed] EqualityOperator
src/main/utils/sortHelper.js:38:18
     }
 
     const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
-    const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
+    const varB = typeof b[key] !== "string" ? b[key].toUpperCase() : b[key];
 
     let comparison = 0;
killedBy: sortHelper tests should sort by name
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    Object {
-     "band": "The Carpenters",

[Killed] ConditionalExpression
src/main/utils/sortHelper.js:38:18
     }
 
     const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
-    const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
+    const varB = true ? b[key].toUpperCase() : b[key];
 
     let comparison = 0;
killedBy: sortHelper tests should sort by year born
statusReason: TypeError: b[key].toUpperCase is not a function

[Killed] BlockStatement
src/main/utils/sortHelper.js:42:22
 
     let comparison = 0;
     // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
-    if (varA > varB) {
-      comparison = 1;
-    } else if (varA < varB) {
+    if (varA > varB) {} else if (varA < varB) {
       comparison = -1;
     }
killedBy: sortHelper tests should sort by band, descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,7 +1,12 @@
  Array [
    Object {

[Killed] ConditionalExpression
src/main/utils/sortHelper.js:42:9
 
     let comparison = 0;
     // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
-    if (varA > varB) {
+    if (false) {
       comparison = 1;
     } else if (varA < varB) {
killedBy: sortHelper tests should sort by band, descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,7 +1,12 @@
  Array [
    Object {

[Killed] ConditionalExpression
src/main/utils/sortHelper.js:44:16
     // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
     if (varA > varB) {
       comparison = 1;
-    } else if (varA < varB) {
+    } else if (false) {
       comparison = -1;
     }
killedBy: SingleRequestDropdown Component renders requests in sorted order by requestCode
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MS program (other than CS Dept BS/MS)",
    "PhD program",

[Killed] EqualityOperator
src/main/utils/sortHelper.js:44:16
     // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
     if (varA > varB) {
       comparison = 1;
-    } else if (varA < varB) {
+    } else if (varA <= varB) {
       comparison = -1;
     }
killedBy: sortHelper tests should sort by year born
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,15 +1,15 @@
  Array [
    Object {

[Killed] UnaryOperator
src/main/utils/sortHelper.js:45:20
     if (varA > varB) {
       comparison = 1;
     } else if (varA < varB) {
-      comparison = -1;
+      comparison = +1;
     }
     return (
killedBy: SingleRequestDropdown Component renders requests in sorted order by requestCode
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MS program (other than CS Dept BS/MS)",
    "PhD program",

[Killed] EqualityOperator
src/main/utils/sortHelper.js:49:7
     }
     return (
       // Stryker disable next-line ArithmeticOperator: The / mutant results in an equivalent mutant
-      order === "desc" ? comparison * -1 : comparison
+      order !== "desc" ? comparison * -1 : comparison
     );
   };
killedBy: SingleRequestDropdown Component renders requests in sorted order by requestCode
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "MS program (other than CS Dept BS/MS)",
-   "PhD program",

[Killed] ConditionalExpression
src/main/utils/sortHelper.js:49:7
     }
     return (
       // Stryker disable next-line ArithmeticOperator: The / mutant results in an equivalent mutant
-      order === "desc" ? comparison * -1 : comparison
+      true ? comparison * -1 : comparison
     );
   };
killedBy: sortHelper tests should sort by name
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  + 11

  Array [
    Object {
-     "band": "The Carpenters",
