[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:67:16
                   </Nav.Link>
                 </>
               ) : null}
-              {systemInfo?.springH2ConsoleEnabled && (
-                <Nav.Link href="/h2-console">H2Console</Nav.Link>
-              )}
+              {systemInfo?.springH2ConsoleEnabled || <Nav.Link href="/h2-console">H2Console</Nav.Link>}
               {systemInfo?.showSwaggerUILink && (
                 <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
