[Killed] BlockStatement
main/components/PendingRequests/PendingRequestsTable.js:7:42
 import { toast } from "react-toastify";
 
 export default function PendingRequestsTable({ requests }) {
-  function cellToAxiosParamsAccept(cell) {
-    return {
-      url: "/api/requests/updateStatus",
-      method: "POST",
-      data: {
-        id: cell.row.values.id,
-        status: "Accepted",
-      },
-    };
-  }
+  function cellToAxiosParamsAccept(cell) {}
 
   function cellToAxiosParamsDeny(cell) {
killedBy: PendingRequestsTable tests clicking Accept sends the correct API call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/PendingRequests/PendingRequestsTable.js:8:12
 
 export default function PendingRequestsTable({ requests }) {
   function cellToAxiosParamsAccept(cell) {
-    return {
-      url: "/api/requests/updateStatus",
-      method: "POST",
-      data: {
-        id: cell.row.values.id,
-        status: "Accepted",
-      },
-    };
+    return {};
   }
 
killedBy: PendingRequestsTable tests clicking Accept sends the correct API call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/PendingRequests/PendingRequestsTable.js:9:12
 export default function PendingRequestsTable({ requests }) {
   function cellToAxiosParamsAccept(cell) {
     return {
-      url: "/api/requests/updateStatus",
+      url: "",
       method: "POST",
       data: {
killedBy: PendingRequestsTable tests clicking Accept sends the correct API call
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request successfully accepted"

Number of calls: 0

[Killed] StringLiteral
main/components/PendingRequests/PendingRequestsTable.js:13:17
       method: "POST",
       data: {
         id: cell.row.values.id,
-        status: "Accepted",
+        status: "",
       },
     };
killedBy: PendingRequestsTable tests clicking Accept sends the correct API call
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "id": 1,
-   "status": "Accepted",

[Killed] BlockStatement
main/components/PendingRequests/PendingRequestsTable.js:18:40
     };
   }
 
-  function cellToAxiosParamsDeny(cell) {
-    return {
-      url: "/api/requests/updateStatus",
-      method: "POST",
-      data: {
-        id: cell.row.values.id,
-        status: "Denied",
-      },
-    };
-  }
+  function cellToAxiosParamsDeny(cell) {}
 
   // Stryker disable all : Hard to test for query caching and side effects
killedBy: PendingRequestsTable tests clicking Deny sends the correct API call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
