[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:76:16
               <option value="Other">Other</option>
             </Form.Select>
             <Form.Control.Feedback type="invalid">
-              {errors.recommendationType?.message}
+              {errors.recommendationType.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:93:16
               {...register("details")}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.details?.message}
+              {errors.details.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
