[Killed] BlockStatement
main/pages/Professor/ProfessorPendingRequestsPage.js:4:44
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
 import { useBackend } from "main/utils/useBackend";
-const ProfessorPendingRequestsPage = () => {
-  const { error: _error, status: _status } = useBackend();
-  // Stryker disable next-line all : don't test internal caching of React Query
-
-  return (
-    <BasicLayout>
-      <h2>Pending Requests</h2>
-    </BasicLayout>
-  );
-};
+const ProfessorPendingRequestsPage = () => {};
 
 export default ProfessorPendingRequestsPage;
killedBy: ProfessorPendingRequestsPage tests renders empty page with title
statusReason: Error: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
