[Killed] BlockStatement
src/main/pages/AdminRequestsPage.js:4:33
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
 import { useBackend } from "main/utils/useBackend";
-const AdminRequestsPage = () => {
-  const { error: _error, status: _status } = useBackend();
-  // Stryker disable next-line all : don't test internal caching of React Query
-
-  return (
-    <BasicLayout>
-      <h2>All Recommendation Requests</h2>
-    </BasicLayout>
-  );
-};
+const AdminRequestsPage = () => {};
 
 export default AdminRequestsPage;
killedBy: AdminRequestsPage tests renders empty page with title
statusReason: Error: Unable to find an element with the text: All Recommendation Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
