[Killed] BlockStatement
main/pages/Professor/ProfessorStatisticsPage.js:4:39
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
 import { useBackend } from "main/utils/useBackend";
-const ProfessorStatisticsPage = () => {
-  const { error: _error, status: _status } = useBackend();
-  // Stryker disable next-line all : don't test internal caching of React Query
-
-  return (
-    <BasicLayout>
-      <h2>Statistics</h2>
-    </BasicLayout>
-  );
-};
+const ProfessorStatisticsPage = () => {};
 
 export default ProfessorStatisticsPage;
killedBy: ProfessorStatisticsPage tests renders empty page with title
statusReason: Error: Unable to find an element with the text: Statistics. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
