[Killed] BlockStatement
main/components/RequestTypes/RequestTypeDropdown.js:19:44
     localSearchType || requestType,
   );
 
-  const handleSubjectOnChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setRequestTypeState(event.target.value);
-    setRequestType(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleSubjectOnChange = (event) => {};
 
   return (
killedBy: RequestTypeDropdown tests when I select an object, the value changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Other"

Number of calls: 0

[Killed] EqualityOperator
main/components/RequestTypes/RequestTypeDropdown.js:23:9
     localStorage.setItem(controlId, event.target.value);
     setRequestTypeState(event.target.value);
     setRequestType(event.target.value);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: RequestTypeDropdown tests when I select an object, the value changes
statusReason: TypeError: onChange is not a function

[Killed] ConditionalExpression
main/components/RequestTypes/RequestTypeDropdown.js:23:9
     localStorage.setItem(controlId, event.target.value);
     setRequestTypeState(event.target.value);
     setRequestType(event.target.value);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: RequestTypeDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/RequestTypes/RequestTypeDropdown.js:36:45
         value={requestTypeState}
         onChange={handleSubjectOnChange}
       >
-        {requestTypes.map(function (object) {
-          const id = object.id;
-          const key = `${controlId}-option-${id}`;
-          return (
-            <option key={key} data-testid={key} value={object.requestType}>
-              {object.requestType}
-            </option>
-          );
-        })}
+        {requestTypes.map(function (object) {})}
       </Form.Control>
     </Form.Group>
killedBy: RequestTypeDropdown tests renders without crashing on three request types
statusReason: Error: Unable to find an element by: [data-testid="ssd1-option-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
