[Killed] ObjectLiteral
main/pages/RequestTypes/RequestTypeCreatePage.js:8:49
 import { toast } from "react-toastify";
 
 export default function RequestTypeCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (requestType) => ({
-    url: "/api/requesttypes/post",
-    method: "POST",
-    params: {
-      requestType: requestType.requestType,
-    },
-  });
+  const objectToAxiosParams = (requestType) => ({});
 
   const onSuccess = (requestType) => {
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/RequestTypes/RequestTypeCreatePage.js:9:10
 
 export default function RequestTypeCreatePage({ storybook = false }) {
   const objectToAxiosParams = (requestType) => ({
-    url: "/api/requesttypes/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Request Type Created - id: 3 value: Study Session"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/RequestTypes/RequestTypeCreatePage.js:16:38
     },
   });
 
-  const onSuccess = (requestType) => {
-    toast(
-      `New Request Type Created - id: ${requestType.id} value: ${requestType.requestType}`,
-    );
-  };
+  const onSuccess = (requestType) => {};
 
   const mutation = useBackendMutation(
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Request Type Created - id: 3 value: Study Session"

Number of calls: 0

[Killed] StringLiteral
main/pages/RequestTypes/RequestTypeCreatePage.js:18:7
 
   const onSuccess = (requestType) => {
     toast(
-      `New Request Type Created - id: ${requestType.id} value: ${requestType.requestType}`,
+      ``,
     );
   };
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Request Type Created - id: 3 value: Study Session"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/RequestTypes/RequestTypeCreatePage.js:35:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/settings/requesttypes" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/settings/requesttypes"}

Number of calls: 0
