[Killed] ConditionalExpression
src/main/pages/HomePage.js:14:12
         <p>
           This is a webapp that allows students to submit different types of
           requests to professors at the University of California, Santa Barbara.
-          {currentUser && currentUser.loggedIn ? (
+          {false ? (
             <span data-testid="home-page-text-navigate">
               {" "}
killedBy: HomePage tests renders correctly for logged in user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="home-page-text-navigate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/HomePage.js:14:12
         <p>
           This is a webapp that allows students to submit different types of
           requests to professors at the University of California, Santa Barbara.
-          {currentUser && currentUser.loggedIn ? (
+          {true ? (
             <span data-testid="home-page-text-navigate">
               {" "}
killedBy: HomePage tests renders correctly for unauthenticated user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="home-page-text-log-in"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
