[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:26:14
   const isCompletedPage = location.pathname.includes("completed");
 
   const editCallback = (cell) => {
-    navigate(`/requests/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: UserTable tests Edit button navigates to the edit page for user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requests/edit/2"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ArrayDeclaration
main/components/RecommendationRequest/RecommendationRequestTable.js:48:5
   const updateStatusMutation = useBackendMutation(
     ({ cell, newStatus }) => cellToAxiosParamsUpdateStatus(cell, newStatus),
     { onSuccess: onUpdateStatusSuccess },
-    [apiEndpoint],
+    [],
   );
   // Stryker restore all
killedBy: RecommendationRequestTable update mutation On success it invalidates the correct apiEndpoint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/api/recommendationrequest/professor/all",
- ]

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:62:33
       { cell, newStatus: "IN PROGRESS" },
       {
         onSuccess: () =>
-          onUpdateStatusSuccess("Request marked as IN PROGRESS."),
+          onUpdateStatusSuccess(""),
       },
     );
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as IN PROGRESS."
Received
       1: {"message": "Recommendation Request updated"}
       2: ""

Number of calls: 2

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:70:7
   const denyCallback = async (cell) => {
     updateStatusMutation.mutate(
       { cell, newStatus: "DENIED" },
-      {
-        onSuccess: () => onUpdateStatusSuccess("Request marked as DENIED."),
-      },
+      {},
     );
   };
killedBy: RecommendationRequestTable update mutation Clicking Deny sends PUT with DENIED and toasts success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request marked as DENIED."
Received: {"message": "Recommendation Request updated"}

Number of calls: 1

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:78:7
 
   const completeCallback = async (cell) => {
     updateStatusMutation.mutate(
-      { cell, newStatus: "COMPLETED" },
+      {},
       {
         onSuccess: () => onUpdateStatusSuccess("Request marked as COMPLETED."),
killedBy: RecommendationRequestTable update mutation Clicking Complete sends PUT with Completed and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:90:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "Professor Name",
-      accessor: "professor.fullName",
-    },
+    {},
     {
       Header: "Professor Email",
killedBy: RecommendationRequestTable apiEndpoint invalidation invalidates '/api/recommendationrequest/requester/all' on a non-pending/non-completed page
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:92:17
     },
     {
       Header: "Professor Name",
-      accessor: "professor.fullName",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professor.fullName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:96:17
     },
     {
       Header: "Professor Email",
-      accessor: "professor.email",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professor.email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:104:17
     },
     {
       Header: "Requester Email",
-      accessor: "requester.email",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-requester.email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:108:17
     },
     {
       Header: "Recommendation Type",
-      accessor: "recommendationType",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-recommendationType"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:118:5
       Header: "Status",
       accessor: "status",
     },
-    {
-      Header: "Submission Date",
-      accessor: "submissionDate",
-      Cell: ({ value }) => {
-        return formattedDate(value);
-      },
-    },
+    {},
     {
       Header: "Last Modified Date",
killedBy: RecommendationRequestTable apiEndpoint invalidation invalidates '/api/recommendationrequest/requester/all' on a non-pending/non-completed page
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:119:15
       accessor: "status",
     },
     {
-      Header: "Submission Date",
+      Header: "",
       accessor: "submissionDate",
       Cell: ({ value }) => {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Submission Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:136:13
       Header: "Completion Date",
       accessor: "completionDate",
       Cell: ({ value }) => {
-        if (!value) return ""; // Check if value exists
+        if (false) return ""; // Check if value exists
         return formattedDate(value);
       },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  NaN/NaN/NaN NaN:NaN

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:149:7
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_PROFESSOR") && isPendingPage) {
+  if (false) {
     columns.push(
       ButtonDropdownColumn(
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-2-col-Update-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:149:7
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_PROFESSOR") && isPendingPage) {
+  if (true) {
     columns.push(
       ButtonDropdownColumn(
killedBy: RecommendationRequestTable update mutation Update button not render for a non-professor on the pending page
statusReason: Error: expect(received).toBeNull()

Received: <button aria-expanded="false" class="dropdown-toggle btn btn-info" data-testid="RecommendationRequestTable-cell-row-0-col-Update-dropdown" id="react-aria-:r22:" type="button">Update</button>

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:153:9
     columns.push(
       ButtonDropdownColumn(
         "Update",
-        "info",
+        "",
         {
           Accept: acceptCallback,
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(element).toHaveClass("btn-info")

Expected the element to have class:
  btn-info
Received:
  dropdown-toggle show btn

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:177:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN") &&
-    !isPendingPage &&
-    !isCompletedPage
+    false
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:177:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN") &&
+    hasRole(currentUser, "ROLE_USER") || !hasRole(currentUser, "ROLE_ADMIN") &&
     !isPendingPage &&
     !isCompletedPage
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead
