[Killed] BlockStatement
main/components/Users/UsersTable.js:11:47
   const queryClient = useQueryClient();
 
   //toggleAdmin
-  function cellToAxiosParamsToggleAdmin(cell) {
-    return {
-      url: "/api/admin/users/toggleAdmin",
-      method: "POST",
-      params: {
-        id: cell.row.values.id,
-      },
-    };
-  }
+  function cellToAxiosParamsToggleAdmin(cell) {}
 
   // Custom mutation that handles errors without the default Axios error
killedBy: UserTable tests toggling admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Users/UsersTable.js:23:21
 
   // Custom mutation that handles errors without the default Axios error
   const toggleAdminMutation = useMutation(
-    async (cell) => {
-      try {
-        const params = cellToAxiosParamsToggleAdmin(cell);
-        const response = await axios(params);
-        return response.data;
-      } catch (error) {
-        if (
-          error.response &&
-          error.response.data &&
-          error.response.data.message
-        ) {
-          toast(`Error: ${error.response.data.message}`);
-        } else {
-          toast(`Error: ${error.message || "Unknown error occurred"}`);
-        }
-        throw error; // Re-throw to maintain error state in mutation
-      }
-    },
+    async (cell) => {},
     {
       onSettled: () => {
killedBy: UserTable tests toggling admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Users/UsersTable.js:24:11
   // Custom mutation that handles errors without the default Axios error
   const toggleAdminMutation = useMutation(
     async (cell) => {
-      try {
-        const params = cellToAxiosParamsToggleAdmin(cell);
-        const response = await axios(params);
-        return response.data;
-      } catch (error) {
+      try {} catch (error) {
         if (
           error.response &&
killedBy: UserTable tests toggling admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Users/UsersTable.js:28:23
         const params = cellToAxiosParamsToggleAdmin(cell);
         const response = await axios(params);
         return response.data;
-      } catch (error) {
-        if (
-          error.response &&
-          error.response.data &&
-          error.response.data.message
-        ) {
-          toast(`Error: ${error.response.data.message}`);
-        } else {
-          toast(`Error: ${error.message || "Unknown error occurred"}`);
-        }
-        throw error; // Re-throw to maintain error state in mutation
-      }
+      } catch (error) {}
     },
     {
killedBy: UserTable tests toggleAdmin error invalidates queries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Access denied"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:30:11
         return response.data;
       } catch (error) {
         if (
-          error.response &&
-          error.response.data &&
+          true &&
           error.response.data.message
         ) {
killedBy: UserTable tests toggleAdmin handles network error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Network Error"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:30:11
         return response.data;
       } catch (error) {
         if (
-          error.response &&
-          error.response.data &&
-          error.response.data.message
+          true
         ) {
           toast(`Error: ${error.response.data.message}`);
killedBy: UserTable tests toggleAdmin handles error without response data message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Request failed with status code 500"
Received: "Error: undefined"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Users/UsersTable.js:33:11
           error.response &&
           error.response.data &&
           error.response.data.message
-        ) {
-          toast(`Error: ${error.response.data.message}`);
-        } else {
+        ) {} else {
           toast(`Error: ${error.message || "Unknown error occurred"}`);
         }
killedBy: UserTable tests toggleAdmin error invalidates queries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Access denied"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/Users/UsersTable.js:35:16
           error.response.data.message
         ) {
           toast(`Error: ${error.response.data.message}`);
-        } else {
-          toast(`Error: ${error.message || "Unknown error occurred"}`);
-        }
+        } else {}
         throw error; // Re-throw to maintain error state in mutation
       }
killedBy: UserTable tests toggleAdmin handles error without response data message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Request failed with status code 500"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] LogicalOperator
main/components/Users/UsersTable.js:36:27
         ) {
           toast(`Error: ${error.response.data.message}`);
         } else {
-          toast(`Error: ${error.message || "Unknown error occurred"}`);
+          toast(`Error: ${error.message && "Unknown error occurred"}`);
         }
         throw error; // Re-throw to maintain error state in mutation
killedBy: UserTable tests toggleAdmin handles error without response data message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Request failed with status code 500"
Received: "Error: Unknown error occurred"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:36:27
         ) {
           toast(`Error: ${error.response.data.message}`);
         } else {
-          toast(`Error: ${error.message || "Unknown error occurred"}`);
+          toast(`Error: ${false}`);
         }
         throw error; // Re-throw to maintain error state in mutation
killedBy: UserTable tests toggleAdmin handles error without response data message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Request failed with status code 500"
Received: "Error: false"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:41:5
         throw error; // Re-throw to maintain error state in mutation
       }
     },
-    {
-      onSettled: () => {
-        queryClient.invalidateQueries(["/api/admin/users"]);
-      },
-      retry: false,
-    },
+    {},
   );
 
killedBy: UserTable tests toggleAdmin success invalidates queries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/api/admin/users"]

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/Users/UsersTable.js:42:24
       }
     },
     {
-      onSettled: () => {
-        queryClient.invalidateQueries(["/api/admin/users"]);
-      },
+      onSettled: () => {},
       retry: false,
     },
killedBy: UserTable tests toggleAdmin success invalidates queries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/api/admin/users"]

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/Users/UsersTable.js:43:40
     },
     {
       onSettled: () => {
-        queryClient.invalidateQueries(["/api/admin/users"]);
+        queryClient.invalidateQueries([""]);
       },
       retry: false,
killedBy: UserTable tests toggleAdmin success invalidates queries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/api/admin/users",
+   "",

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:45:14
       onSettled: () => {
         queryClient.invalidateQueries(["/api/admin/users"]);
       },
-      retry: false,
+      retry: true,
     },
   );
killedBy: UserTable tests toggleAdmin error invalidates queries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/api/admin/users"]

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/Users/UsersTable.js:54:51
     toggleAdminMutation.mutate(cell);
   };
 
-  function cellToAxiosParamsToggleProfessor(cell) {
-    return {
-      url: "/api/admin/users/toggleProfessor",
-      method: "POST",
-      params: {
-        id: cell.row.values.id,
-      },
-    };
-  }
+  function cellToAxiosParamsToggleProfessor(cell) {}
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests toggling professor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
