[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:5:30
 import UsersTable from "main/components/Users/UsersTable";
 import { useCurrentUser } from "main/utils/currentUser";
 import { useBackend } from "main/utils/useBackend";
-const AdminUsersPage = () => {
-  const { data: currentUser } = useCurrentUser();
-  const {
-    data: users,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/admin/users"],
-    { method: "GET", url: "/api/admin/users" },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <h2>Users</h2>
-      <UsersTable users={users} currentUser={currentUser} />
-    </BasicLayout>
-  );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: Unable to find an element with the text: Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrayDeclaration
src/main/pages/AdminUsersPage.js:15:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/users"],
     { method: "GET", url: "/api/admin/users" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: AdminUsersPage tests renders empty table when backend unavailable
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="UsersTable-cell-row-0-col-id" role="cell" /> instead
