[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:9:60
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell, currentUser) {
-  const { requester, professor, id } = cell.row.original;
-
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    return {
-      url: "/api/recommendationrequest/admin",
-      method: "DELETE",
-      params: { id },
-    };
-  } else if (requester.id === currentUser.root.user.id) {
-    return {
-      url: "/api/recommendationrequest",
-      method: "DELETE",
-      params: { id },
-    };
-  } else if (professor.id === currentUser.root.user.id) {
-    return {
-      url: "/api/recommendationrequest/professor",
-      method: "DELETE",
-      params: { id },
-    };
-  } else {
-    throw new Error("Not authorized to delete this request");
-  }
-}
+export function cellToAxiosParamsDelete(cell, currentUser) {}
 
 export const formattedDate = (val) => {
killedBy: RecommendationRequestTable apiEndpoint invalidation invalidates '/api/recommendationrequest/requester/all' on a non-pending/non-completed page
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:12:43
 export function cellToAxiosParamsDelete(cell, currentUser) {
   const { requester, professor, id } = cell.row.original;
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    return {
-      url: "/api/recommendationrequest/admin",
-      method: "DELETE",
-      params: { id },
-    };
-  } else if (requester.id === currentUser.root.user.id) {
+  if (hasRole(currentUser, "ROLE_ADMIN")) {} else if (requester.id === currentUser.root.user.id) {
     return {
       url: "/api/recommendationrequest",
killedBy: UserTable tests Delete button calls delete callback (admin)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:15:15
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     return {
       url: "/api/recommendationrequest/admin",
-      method: "DELETE",
+      method: "",
       params: { id },
     };
killedBy: UserTable tests Delete button calls delete callback (admin)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/main/utils/RecommendationRequestUtils.js:18:14
       method: "DELETE",
       params: { id },
     };
-  } else if (requester.id === currentUser.root.user.id) {
+  } else if (true) {
     return {
       url: "/api/recommendationrequest",
killedBy: RecommendationRequestTable apiEndpoint invalidation invalidates '/api/recommendationrequest/professor/all' on a pending page
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "/api/recommendationrequest/professor"
Received: "/api/recommendationrequest"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/main/utils/RecommendationRequestUtils.js:18:14
       method: "DELETE",
       params: { id },
     };
-  } else if (requester.id === currentUser.root.user.id) {
+  } else if (false) {
     return {
       url: "/api/recommendationrequest",
killedBy: RecommendationRequestTable apiEndpoint invalidation invalidates '/api/recommendationrequest/requester/all' on a non-pending/non-completed page
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:22:15
     return {
       url: "/api/recommendationrequest",
       method: "DELETE",
-      params: { id },
+      params: {},
     };
   } else if (professor.id === currentUser.root.user.id) {
killedBy: UserTable tests Delete button calls delete callback (for requester)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 2,
- }

[Killed] EqualityOperator
src/main/utils/RecommendationRequestUtils.js:24:14
       method: "DELETE",
       params: { id },
     };
-  } else if (professor.id === currentUser.root.user.id) {
+  } else if (professor.id !== currentUser.root.user.id) {
     return {
       url: "/api/recommendationrequest/professor",
killedBy: RecommendationRequestTable apiEndpoint invalidation invalidates '/api/recommendationrequest/professor/all' on a pending page
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ConditionalExpression
src/main/utils/RecommendationRequestUtils.js:24:14
       method: "DELETE",
       params: { id },
     };
-  } else if (professor.id === currentUser.root.user.id) {
+  } else if (true) {
     return {
       url: "/api/recommendationrequest/professor",
killedBy: RecommendationRequestUtils cellToAxiosParamsDelete Others get authorization error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Not authorized to delete this request"

Received function did not throw

[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:30:10
       method: "DELETE",
       params: { id },
     };
-  } else {
-    throw new Error("Not authorized to delete this request");
-  }
+  } else {}
 }
 
killedBy: RecommendationRequestUtils cellToAxiosParamsDelete Others get authorization error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Not authorized to delete this request"

Received function did not throw

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:31:21
       params: { id },
     };
   } else {
-    throw new Error("Not authorized to delete this request");
+    throw new Error("");
   }
 }
killedBy: RecommendationRequestUtils cellToAxiosParamsDelete Others get authorization error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Not authorized to delete this request"
Received message:   ""

      111 |       } else {
      112 |         stryCov_9fa48("567");
    > 113 |         throw new Error(stryMutAct_9fa48("568") ? "" : (stryCov_9fa48("568"), "Not authorized to delete this request"));

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:47:10
 }
 
 export function cellToAxiosParamsUpdateStatus(cell, newStatus) {
-  return {
-    url: "/api/recommendationrequest/professor",
-    method: "PUT",
-    params: {
-      id: cell.row.values.id,
-    },
-    data: {
-      status: newStatus,
-    },
-  };
+  return {};
 }
 
killedBy: RecommendationRequestTable update mutation Clicking Accept sends PUT with IN PROGRESS and toasts success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
